iPig/src/InformationRegisters/КарточкаХряка/КарточкаХряка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаХряка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПричины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоСвиноматка</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыСвиноматка</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытиеСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытияСвиноматка</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпоросаСвиноматка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОсеменения/ЖурналОсеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОсеменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпоросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк1</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк2</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк1</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк2</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценкаСлучки</name>
    <type>
      <types>EnumRef.ОценкаСлучки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаХряка/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура КарточкаХрякаНаСервере(ТабДок)
	Макет = РегистрыСведений.КарточкаХряка.ПолучитьМакет("Макет");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблица = Макет.ПолучитьОбласть("ШапкаТаблица");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	Для Каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Стр);
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьШапкаТаблица);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	КарточкаХряка.НомерЖивотного КАК НомерЖивотного,
					   |	КарточкаХряка.ДатаРождения КАК ДатаРождения,
					   |	КарточкаХряка.КодПороды КАК КодПороды,
					   |	КарточкаХряка.Период КАК ДатаВвода,
					   |	КарточкаХряка.ДатаВыбытие КАК ДатаВыбытие,
					   |	ГОД(ЖурналОсеменения.Период) КАК СлучнойПериод,
					   |	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
					   |	ЖурналОсеменения.Период КАК ПокрытоМаток,
					   |	ЖурналОсеменения.НомерЖивотного КАК Свиноматка
					   |ПОМЕСТИТЬ ВТДанные
					   |ИЗ
					   |	РегистрСведений.КарточкаХряка КАК КарточкаХряка
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
					   |		ПО (КарточкаХряка.НомерЖивотного = ЖурналОсеменения.НомерЖивотногоХряк
					   |				ИЛИ КарточкаХряка.НомерЖивотного = ЖурналОсеменения.НомерЖивотногоХряк1
					   |				ИЛИ КарточкаХряка.НомерЖивотного = ЖурналОсеменения.НомерЖивотногоХряк2)
					   |ГДЕ
					   |	КарточкаХряка.НомерЖивотного = &НомерЖивотного
					   |	И КарточкаХряка.Период = &Период
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ЖурналОсеменения.Период КАК Период,
					   |	ЖурналОсеменения.НомерОпороса КАК НомерОпороса,
					   |	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
					   |	ЖурналОпороса.Период КАК ПериодОпорос,
					   |	ЖурналОпороса.Живорожденные КАК Живорожденные,
					   |	ЖурналОпороса.Мертвые КАК Мертвые,
					   |	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
					   |	ЖурналОпороса.Муммии КАК Муммии,
					   |	ЖурналОтъема.Период КАК ПериодОтъем,
					   |	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
					   |	ЖурналОтъема.СреднийВес КАК СреднийВес
					   |ПОМЕСТИТЬ ВТОбщая
					   |ИЗ
					   |	ВТДанные КАК ВТДанные
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
					   |		ПО ВТДанные.Свиноматка = ЖурналОсеменения.НомерЖивотного
					   |			И ВТДанные.НомерОпороса = ЖурналОсеменения.НомерОпороса
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
					   |		ПО ВТДанные.Свиноматка = ЖурналОпороса.НомерЖивотного
					   |			И ВТДанные.НомерОпороса = ЖурналОпороса.НомерОпороса
					   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
					   |		ПО ВТДанные.Свиноматка = ЖурналОтъема.НомерЖивотного
					   |			И ВТДанные.НомерОпороса = ЖурналОтъема.НомерОпороса
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	ГОД(ВТОбщая.Период) КАК Период,
					   |	ВТОбщая.Живорожденные КАК Живорожденные,
					   |	ВТОбщая.Мертвые КАК Мертвые,
					   |	ВТОбщая.Слаборожденные КАК Слаборожденные,
					   |	ВТОбщая.Муммии КАК Муммии,
					   |	ВТОбщая.КоличествоОтъемышей КАК КоличествоОтъемышей,
					   |	ВТОбщая.СреднийВес КАК СреднийВес
					   |ПОМЕСТИТЬ ВТДанныеОпорос
					   |ИЗ
					   |	ВТОбщая КАК ВТОбщая
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВТДанные.СлучнойПериод КАК СлучнойПериод,
					   |	КОЛИЧЕСТВО(ВТДанные.НомерЖивотного) КАК НомерЖивотного
					   |ПОМЕСТИТЬ ВТОпоросов
					   |ИЗ
					   |	ВТДанные КАК ВТДанные
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ВТДанные.СлучнойПериод
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ГОД(ВТОбщая.Период) КАК СлучнойПериод,
					   |	КОЛИЧЕСТВО(ВТОбщая.НомерЖивотного) КАК НомерЖивотного
					   |ПОМЕСТИТЬ ВТОсеменений
					   |ИЗ
					   |	ВТОбщая КАК ВТОбщая
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ГОД(ВТОбщая.Период)
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВТДанныеОпорос.Период КАК Период,
					   |	СУММА(ВТДанныеОпорос.Живорожденные) + СУММА(ВТДанныеОпорос.Мертвые) + СУММА(ВТДанныеОпорос.Слаборожденные) + СУММА(ВТДанныеОпорос.Муммии) КАК Родилось,
					   |	СУММА(ВТДанныеОпорос.Живорожденные) КАК Живые,
					   |	СУММА(ВТДанныеОпорос.КоличествоОтъемышей) КАК КоличествоОтъемышей,
					   |	СУММА(ВТДанныеОпорос.СреднийВес) КАК СреднийВес
					   |ПОМЕСТИТЬ ВТОпоросИтог
					   |ИЗ
					   |	ВТДанныеОпорос КАК ВТДанныеОпорос
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ВТДанныеОпорос.Период
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ
					   |	ВТОсеменений.СлучнойПериод КАК СлучнойПериод,
					   |	ВТОсеменений.НомерЖивотного КАК ПокрытоМаток,
					   |	ВТОпоросов.НомерЖивотного КАК Опоросилось,
					   |	ВТОсеменений.НомерЖивотного - ВТОпоросов.НомерЖивотного КАК Повторок,
					   |	ОКР(ВТОпоросИтог.Родилось / ВТОсеменений.НомерЖивотного, 2) КАК Родилось,
					   |	ОКР(ВТОпоросИтог.Живые / ВТОсеменений.НомерЖивотного, 2) КАК Живые,
					   |	ОКР(ВТОпоросИтог.КоличествоОтъемышей / ВТОсеменений.НомерЖивотного, 2) КАК КоличествоОтъемышей,
					   |	ВТОпоросИтог.СреднийВес КАК МассаГнезда
					   |ИЗ
					   |	ВТОсеменений КАК ВТОсеменений
					   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОпоросИтог КАК ВТОпоросИтог
					   |		ПО ВТОсеменений.СлучнойПериод = ВТОпоросИтог.Период
					   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОпоросов КАК ВТОпоросов
					   |		ПО ВТОсеменений.СлучнойПериод = ВТОпоросов.СлучнойПериод";
		Запрос.УстановитьПараметр("НомерЖивотного", Стр.НомерЖивотного);
		Запрос.УстановитьПараметр("Период", Стр.Период);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, РезультатЗапроса);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КарточкаХряка(Команда)
	ТабДок = Новый ТабличныйДокумент;
	КарточкаХрякаНаСервере(ТабДок);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры
